
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/15750250059)



<pre><code>Apply complete! Resources: 0 added, 18 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.http.my_file: Reading...
cloudflare_zero_trust_access_tag.tags["wan"]: Refreshing state... [id=wan]
cloudflare_zero_trust_access_tag.tags["wifi"]: Refreshing state... [id=wifi]
cloudflare_zone.mylabs_dev: Refreshing state... [id=2859c4d6f599a36a424765646b79904e]
cloudflare_zero_trust_access_tag.tags["iot"]: Refreshing state... [id=iot]
cloudflare_zone.xvx_cz: Refreshing state... [id=b84174cc7be41b21a9c36d62aff39e84]
cloudflare_zone.ruzicka_dev: Refreshing state... [id=452e45a673326608122e759793a713f3]
cloudflare_zero_trust_access_policy.google_sso_access: Refreshing state... [id=9a0319bc-fae3-45ef-b6e9-375a9e8c2d42]
cloudflare_zero_trust_access_identity_provider.google_oauth: Refreshing state... [id=7b1954fa-bbd2-4cf3-9377-1299319b9956]
cloudflare_zero_trust_access_policy.allow_all: Refreshing state... [id=d500f04e-d4dd-43b3-bf27-095e33951016]
cloudflare_zero_trust_access_tag.tags["lan"]: Refreshing state... [id=lan]
cloudflare_zero_trust_access_tag.tags["router"]: Refreshing state... [id=router]
cloudflare_zero_trust_access_tag.tags["rpi"]: Refreshing state... [id=rpi]
cloudflare_zero_trust_access_tag.tags["container"]: Refreshing state... [id=container]
cloudflare_dns_record.ns3_k8s_mylabs_dev: Refreshing state... [id=8409985e399eb9ff87bb26e9663b8903]
cloudflare_dns_record.cname_www_mylabs_dev: Refreshing state... [id=d3feaa152c14f6f38c69d384ba4f5111]
cloudflare_dns_record.ns4_aws_mylabs_dev: Refreshing state... [id=9bdfd9d4ad07b2946910408a7abbf540]
cloudflare_dns_record.ns2_k8s_mylabs_dev: Refreshing state... [id=735395882005c878dfcfdaa0fc3c0b4a]
cloudflare_dns_record.cname_rwmt1_domainkey_link_mylabs_dev: Refreshing state... [id=007cb1777f78ed18fb4b14cbfa872d1f]
cloudflare_dns_record.cname_mt_link_mylabs_dev: Refreshing state... [id=6bb09577857f4f447fff84b120614362]
cloudflare_dns_record.ns4_k8s_mylabs_dev: Refreshing state... [id=edeb28878e93de06491a321036737864]
cloudflare_dns_record.ns3_aws_mylabs_dev: Refreshing state... [id=d207b2188295decc79b025a03bbd5928]
cloudflare_dns_record.cname_rwmt2_domainkey_link_mylabs_dev: Refreshing state... [id=6bff1bda469bfa6b581e907646138d69]
cloudflare_dns_record.ns1_aws_mylabs_dev: Refreshing state... [id=fdb99a821d84d9685861804054b04cf9]
cloudflare_dns_record.cname_mt84_link_mylabs_dev: Refreshing state... [id=3121eca2afec69e3f4185d9aafe372b8]
cloudflare_dns_record.txt_dmarc_mylabs_dev: Refreshing state... [id=d2575dfb154016feed5064ccb1aaf659]
data.http.my_file: Read complete after 0s [id=https://uptimerobot.com/inc/files/ips/IPv4andIPv6.txt]
cloudflare_dns_record.cname_mylabs_dev: Refreshing state... [id=512175704937e92cfc53a4711bcfba1a]
cloudflare_dns_record.ns1_k8s_mylabs_dev: Refreshing state... [id=bb4675cb0c3a2fcb29cec8d26a466d54]
cloudflare_dns_record.ns2_aws_mylabs_dev: Refreshing state... [id=c09981c61ebf3756ff5f717ced460d7c]
cloudflare_dns_record.mx2_xvx_cz: Refreshing state... [id=f0b0eafd0d4dbe89a2e5130ed376afcf]
cloudflare_dns_record.cname_cestovani_xvx_cz: Refreshing state... [id=13762e91a934735c093cd338d3f9b577]
cloudflare_dns_record.mx4_xvx_cz: Refreshing state... [id=1f909e273d7f77cb8d2ade9c2b33f5a8]
cloudflare_dns_record.cname_svatba_xvx_cz: Refreshing state... [id=6deb708f40e8cdc44af9f26214041d50]
cloudflare_dns_record.txt_acme_challenge_auth_infra_xvx_cz: Refreshing state... [id=266ba9c4df2471841c54dc3cec8821a5]
cloudflare_dns_record.mx3_xvx_cz: Refreshing state... [id=3b89d2aec9feac9aaf4f591f6dc38587]
cloudflare_dns_record.cname_www_linux_xvx_cz: Refreshing state... [id=7a420cfcd4e1d79d95988c348ee138f7]
cloudflare_dns_record.cname_www_ruzickovabozena_xvx_cz: Refreshing state... [id=74c6f605b8e3bdadda60e83b1072da46]
cloudflare_dns_record.txt_dkim1_google_domainkey_xvx_cz: Refreshing state... [id=7a6aca074c2c843300481dd24b367db9]
cloudflare_dns_record.mx5_xvx_cz: Refreshing state... [id=5aa6aab8b2b89bebf1907dc080e058b5]
cloudflare_dns_record.spf_txt_ruzicka_dev: Refreshing state... [id=37c6dd1d4f442313753b992ef048ab84]
cloudflare_dns_record.cname_blog_ruzicka_dev: Refreshing state... [id=40b2f2c58767f934a85dd09857036003]
cloudflare_dns_record.cname_petr_ruzicka_dev: Refreshing state... [id=560582f3686f60730649302acc4a54f6]
cloudflare_dns_record.cname_stats_ruzickap_github_io_ruzicka_dev: Refreshing state... [id=4e6ec427d1f22a61d21b3e6e401d9475]
cloudflare_dns_record.mx1_ruzicka_dev: Refreshing state... [id=72c3096bb3dfbbea638b11ec6a9084f1]
cloudflare_dns_record.cname_www_svatba_xvx_cz: Refreshing state... [id=1c9fcf3f9970c7205ac0866edfd967f3]
cloudflare_dns_record.txt_cf2024_1_domainkey_ruzicka_dev: Refreshing state... [id=a21bd05ef17e1277f9f0ec1756b8f320]
cloudflare_dns_record.mx2_ruzicka_dev: Refreshing state... [id=998e7ce6783759477c42e79b700f2a2b]
cloudflare_dns_record.cname_www_ruzicka_dev: Refreshing state... [id=54daa51645ec0c8268be734d23ff39ea]
cloudflare_dns_record.txt_google_site_verification_xvx_cz: Refreshing state... [id=d3dec2add7b745e8ad95b9dde7ec4692]
cloudflare_dns_record.cname_linux_xvx_cz: Refreshing state... [id=5df4b6886b43d1d615360f3bab861527]
cloudflare_dns_record.mx1_xvx_cz: Refreshing state... [id=088cef876698a0ddcbca2026a21bfd95]
cloudflare_dns_record.cname_ruzickovabozena_xvx_cz: Refreshing state... [id=2dd46a0ff555377bb1ca39e2294e2734]
cloudflare_dns_record.a_raspi_xvx_cz: Refreshing state... [id=42b1926b3be431f1d598085c32193eca]
cloudflare_dns_record.cname_www_linux_old_xvx_cz: Refreshing state... [id=4a810c020747f52c0e5638fb16034770]
cloudflare_dns_record.cname_www_xvx_cz: Refreshing state... [id=c7fb0d86b11373cd9cde58aa1ae5a789]
cloudflare_dns_record.cname_byt_xvx_cz: Refreshing state... [id=4ec0db0c0a3324765b5d8909e6edba5f]
cloudflare_dns_record.cname_petr_xvx_cz: Refreshing state... [id=7d211321aa14c8b2bb46b5884370bb0d]
cloudflare_dns_record.txt_dmarc1_dmarc_xvx_cz: Refreshing state... [id=2ec53d109d14c8bb15fb8dcaced94292]
cloudflare_dns_record.txt_spf1_xvx_cz: Refreshing state... [id=06890237b2511496df6878acb9824f33]
cloudflare_dns_record.a_stats_xvx_cz: Refreshing state... [id=b90204c8ccf0315cbf61a258dc06c2e3]
cloudflare_dns_record.cname_xvx_cz: Refreshing state... [id=129f72a534e70fdde7f7b0d0d8de09f8]
cloudflare_dns_record.cname_linux_old_xvx_cz: Refreshing state... [id=15fb100a9e230402aa1c86f3d58efe9e]
cloudflare_dns_record.cname_ruzicka_dev: Refreshing state... [id=6012deab4c329d17d2c64685ab381aa1]
cloudflare_dns_record.txt_github_pages_challenge_ruzickap_ruzicka_dev: Refreshing state... [id=3278fdec9a5bee7946a9d4cd65dc7645]
cloudflare_dns_record.a_gate_bracha_xvx_cz: Refreshing state... [id=9be04858272f22620ad1b27cd7b5f76e]
cloudflare_dns_record.mx3_ruzicka_dev: Refreshing state... [id=dc2ccc3ddf800440e8cb36b2750628ff]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["gate"]: Refreshing state... [id=ea76ae8f-c3a6-456e-8e4a-7e47535bfd60]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["raspi"]: Refreshing state... [id=5c15aae0-7175-43c1-9d05-9198ffe3a577]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["gate-peterovi"]: Refreshing state... [id=c8169c22-058c-4fdc-bc57-989f00964f13]
cloudflare_zero_trust_list.uptimerobot_ips: Refreshing state... [id=ad2a4ab0-b97b-43aa-916b-b7690e92121f]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["gate-peterovi"]: Refreshing state... [id=c8169c22-058c-4fdc-bc57-989f00964f13]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["gate"]: Refreshing state... [id=ea76ae8f-c3a6-456e-8e4a-7e47535bfd60]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["raspi"]: Refreshing state... [id=5c15aae0-7175-43c1-9d05-9198ffe3a577]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Refreshing state... [id=c872ad2e-c80f-486b-b38d-7f2cecf860a6]
cloudflare_dns_record.cname_zero_trust_tunnel["alloy-rpi.xvx.cz"]: Refreshing state... [id=790fd0b5cb7956b51eced909bce019d3]
cloudflare_dns_record.cname_zero_trust_tunnel["grafana-rpi.xvx.cz"]: Refreshing state... [id=403e8278b7e9afb620218018fd6f68b5]
cloudflare_dns_record.cname_zero_trust_tunnel["uzg-01.xvx.cz"]: Refreshing state... [id=89748e1952e4795756d9caf1e543d792]
cloudflare_dns_record.cname_zero_trust_tunnel["cadvisor-rpi.xvx.cz"]: Refreshing state... [id=4a2468d46b5200cdb00aa5ba037b3569]
cloudflare_dns_record.cname_zero_trust_tunnel["rpi-ssh.xvx.cz"]: Refreshing state... [id=86bfac0e5b46d507799368bc9295c0e7]
cloudflare_dns_record.cname_zero_trust_tunnel["transmission.xvx.cz"]: Refreshing state... [id=33f8e2054cc6a3e15e1b0ab7ccb14ce3]
cloudflare_dns_record.cname_zero_trust_tunnel["gate-ssh-peterovi.xvx.cz"]: Refreshing state... [id=c4d31b4b92e8645c42aab3aacc5f5cb0]
cloudflare_dns_record.cname_zero_trust_tunnel["kodi-rpi.xvx.cz"]: Refreshing state... [id=d7c66f1e1b4ffeaefd2d65ad3883c7b5]
cloudflare_dns_record.cname_zero_trust_tunnel["prometheus-rpi.xvx.cz"]: Refreshing state... [id=7562d6ccc0e629a888b568d608be401a]
cloudflare_dns_record.cname_zero_trust_tunnel["gate.xvx.cz"]: Refreshing state... [id=249e203eaabf50ae7e2642ce2160561b]
cloudflare_dns_record.cname_zero_trust_tunnel["gate-ssh.xvx.cz"]: Refreshing state... [id=5f0ab4260c66d10d80e766502fea912a]
cloudflare_dns_record.cname_zero_trust_tunnel["msr-2.xvx.cz"]: Refreshing state... [id=06827eea52d920921eac677af18810aa]
cloudflare_dns_record.cname_zero_trust_tunnel["rpi.xvx.cz"]: Refreshing state... [id=fb32687d486ded50d5f52653c10e526c]
cloudflare_dns_record.cname_zero_trust_tunnel["zigbee2mqtt-rpi.xvx.cz"]: Refreshing state... [id=70b9beba69051f2ce7bb77026f1936d1]
cloudflare_dns_record.cname_zero_trust_tunnel["gate-peterovi.xvx.cz"]: Refreshing state... [id=4f9c75b3240bf59a79321cff2100a86f]
cloudflare_dns_record.cname_zero_trust_tunnel["esphome-rpi.xvx.cz"]: Refreshing state... [id=12f31538fad4abfcd8ae57ea6773d588]
cloudflare_dns_record.cname_zero_trust_tunnel["hass-rpi.xvx.cz"]: Refreshing state... [id=3420996168914938f6006962f17e0cc1]
cloudflare_zero_trust_access_application.applications["msr-2"]: Refreshing state... [id=691b1dd6-ec52-4661-9cc0-fee6fb878179]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Refreshing state... [id=5a7e1ecf-de54-4478-bb65-d8d543754e80]
cloudflare_zero_trust_access_application.applications["rpi"]: Refreshing state... [id=fd331c0a-615a-4371-ac07-e033d7f4b47f]
cloudflare_zero_trust_access_application.applications["gate"]: Refreshing state... [id=3136e7d6-6f45-4d3b-8b45-e9ec0fc51aa4]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Refreshing state... [id=a5acb80a-2caf-43f8-8f59-4711bdfaa0ad]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Refreshing state... [id=f1ce7728-8f01-4b03-9e07-25d4c4383d6f]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Refreshing state... [id=17db62a4-3bfd-49f0-bb6c-801a259cfd6c]
cloudflare_zero_trust_access_application.applications["gate-peterovi"]: Refreshing state... [id=9f055b30-d866-4f4d-8193-58dbe7e3c35d]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Refreshing state... [id=d9f86441-7de2-443f-85e1-0790a9d59372]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Refreshing state... [id=373a3587-41f2-48b1-a3b3-77642261452d]
cloudflare_zero_trust_access_application.applications["transmission"]: Refreshing state... [id=dd230d90-8470-4e9a-ba23-ea5a569c8179]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Refreshing state... [id=d092e1e6-d991-47cf-b49f-a7ff9d2c1635]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Refreshing state... [id=5d3c261b-d8db-4111-9eff-e9b47b5050e1]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Refreshing state... [id=def0d7ca-69a4-4f4c-b964-fc8718977b72]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.applications["alloy-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "7e1a3cf4f1feaa930fb710ff036083a7a370c0e802abb603f2ad92aeb159012b" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "alloy-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "f1ce7728-8f01-4b03-9e07-25d4c4383d6f"
      + landing_page_design          = (known after apply)
        name                         = "alloy-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "alloy-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "80b9dd2bfc3e93fa78c36418f29f47335e97a10e2737dbb21273d5389f1e9009" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "cadvisor-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "d9f86441-7de2-443f-85e1-0790a9d59372"
      + landing_page_design          = (known after apply)
        name                         = "cadvisor-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "cadvisor-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "8cb3fded19c0fa56fcffb057d0eb2fbd3c97249b58dd59b2655029645dceb10e" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "esphome-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "373a3587-41f2-48b1-a3b3-77642261452d"
      + landing_page_design          = (known after apply)
        name                         = "esphome-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "esphome-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "afdb02d1b7bd0efa48b3e8dc37a1f9f58e6972d026e18a9f46030583dbeae49b" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate.xvx.cz" -> null
            },
        ] -> null
        id                           = "3136e7d6-6f45-4d3b-8b45-e9ec0fc51aa4"
      + landing_page_design          = (known after apply)
        name                         = "gate"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate-peterovi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "118319956b5912e799bcd3732853e8c884d37fda7ed6c76c54990e270b16ee0f" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate-peterovi.xvx.cz" -> null
            },
        ] -> null
        id                           = "9f055b30-d866-4f4d-8193-58dbe7e3c35d"
      + landing_page_design          = (known after apply)
        name                         = "gate-peterovi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate-peterovi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "f057d168ef9f84a34cd08a1e489d43c8a5881e588d6233871d3277dd79c68d10" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "grafana-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "def0d7ca-69a4-4f4c-b964-fc8718977b72"
      + landing_page_design          = (known after apply)
        name                         = "grafana-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "grafana-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "3711c79427fbbe6321f8e00054a839eccfaf5e3da8a802cd809a856aa8a4b1d0" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "hass-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "d092e1e6-d991-47cf-b49f-a7ff9d2c1635"
      + landing_page_design          = (known after apply)
        name                         = "hass-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "d500f04e-d4dd-43b3-bf27-095e33951016"
              - include    = [
                  - {
                      - everyone = {} -> null
                    },
                ] -> null
              - name       = "Allow All" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "hass-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "a5c36d1f3797330340aa37dedbad8dcddf43b503a93d1f8cd1168fbc2053c1f5" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "kodi-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "5d3c261b-d8db-4111-9eff-e9b47b5050e1"
      + landing_page_design          = (known after apply)
        name                         = "kodi-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "kodi-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["msr-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "9c664e37cf334fad33ee60aaa079c2845081bd3b6e6388b778dcf849baa48e67" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "691b1dd6-ec52-4661-9cc0-fee6fb878179"
      + landing_page_design          = (known after apply)
        name                         = "msr-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "iot",
            "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "1ffccdd9f2501869fef4272df0249c40fc0c3d5993d5f02ef0a2cefdd1fd933f" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "prometheus-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "5a7e1ecf-de54-4478-bb65-d8d543754e80"
      + landing_page_design          = (known after apply)
        name                         = "prometheus-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "prometheus-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "4db21a09f636ce531acbbd95d7240daf695c85802a9605285f1c06990d11b0f3" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "fd331c0a-615a-4371-ac07-e033d7f4b47f"
      + landing_page_design          = (known after apply)
        name                         = "rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
            "container",
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:12Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["transmission"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "0e757f804830719e31bc56138d2754f95f1ce95220e872368937fcf32a28540d" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "transmission.xvx.cz" -> null
            },
        ] -> null
        id                           = "dd230d90-8470-4e9a-ba23-ea5a569c8179"
      + landing_page_design          = (known after apply)
        name                         = "transmission"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "transmission.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "router",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["uzg-01"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "0675113737df63ed3d4af6bc672816715eb6fc67458fbbec45500d99fd3ce72a" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01.xvx.cz" -> null
            },
        ] -> null
        id                           = "17db62a4-3bfd-49f0-bb6c-801a259cfd6c"
      + landing_page_design          = (known after apply)
        name                         = "uzg-01"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "iot",
            "lan",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "544fd986c1ccab0693cc8d6925f73697466945380ffb117994a4b70a0727d097" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "zigbee2mqtt-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "a5acb80a-2caf-43f8-8f59-4711bdfaa0ad"
      + landing_page_design          = (known after apply)
        name                         = "zigbee2mqtt-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "zigbee2mqtt-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "7b1954fa-bbd2-4cf3-9377-1299319b9956"
        name        = "Google IDP"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.allow_all will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "allow_all" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-06-19T05:07:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "d500f04e-d4dd-43b3-bf27-095e33951016"
        name             = "Allow All"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-06-19T05:26:07Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 13 -> (known after apply)
      ~ created_at       = "2025-06-19T05:07:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
        name             = "Google SSO Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-06-19T05:26:07Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 13 -> (known after apply)
      ~ created_at       = "2025-06-19T05:07:02Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
        name             = "UptimeRobot Direct Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-06-19T05:26:07Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 18 to change, 0 to destroy.
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifying... [id=7b1954fa-bbd2-4cf3-9377-1299319b9956]
cloudflare_zero_trust_access_policy.google_sso_access: Modifying... [id=9a0319bc-fae3-45ef-b6e9-375a9e8c2d42]
cloudflare_zero_trust_access_policy.allow_all: Modifying... [id=d500f04e-d4dd-43b3-bf27-095e33951016]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifying... [id=c872ad2e-c80f-486b-b38d-7f2cecf860a6]
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifications complete after 0s [id=7b1954fa-bbd2-4cf3-9377-1299319b9956]
cloudflare_zero_trust_access_policy.allow_all: Modifications complete after 0s [id=d500f04e-d4dd-43b3-bf27-095e33951016]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifications complete after 0s [id=c872ad2e-c80f-486b-b38d-7f2cecf860a6]
cloudflare_zero_trust_access_policy.google_sso_access: Modifications complete after 0s [id=9a0319bc-fae3-45ef-b6e9-375a9e8c2d42]
cloudflare_zero_trust_access_application.applications["transmission"]: Modifying... [id=dd230d90-8470-4e9a-ba23-ea5a569c8179]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Modifying... [id=d092e1e6-d991-47cf-b49f-a7ff9d2c1635]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Modifying... [id=5a7e1ecf-de54-4478-bb65-d8d543754e80]
cloudflare_zero_trust_access_application.applications["gate"]: Modifying... [id=3136e7d6-6f45-4d3b-8b45-e9ec0fc51aa4]
cloudflare_zero_trust_access_application.applications["rpi"]: Modifying... [id=fd331c0a-615a-4371-ac07-e033d7f4b47f]
cloudflare_zero_trust_access_application.applications["msr-2"]: Modifying... [id=691b1dd6-ec52-4661-9cc0-fee6fb878179]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Modifying... [id=17db62a4-3bfd-49f0-bb6c-801a259cfd6c]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Modifying... [id=def0d7ca-69a4-4f4c-b964-fc8718977b72]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Modifying... [id=f1ce7728-8f01-4b03-9e07-25d4c4383d6f]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Modifying... [id=d9f86441-7de2-443f-85e1-0790a9d59372]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Modifications complete after 0s [id=d092e1e6-d991-47cf-b49f-a7ff9d2c1635]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Modifications complete after 0s [id=5a7e1ecf-de54-4478-bb65-d8d543754e80]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Modifying... [id=a5acb80a-2caf-43f8-8f59-4711bdfaa0ad]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Modifying... [id=373a3587-41f2-48b1-a3b3-77642261452d]
cloudflare_zero_trust_access_application.applications["rpi"]: Modifications complete after 0s [id=fd331c0a-615a-4371-ac07-e033d7f4b47f]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Modifications complete after 0s [id=def0d7ca-69a4-4f4c-b964-fc8718977b72]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Modifications complete after 0s [id=17db62a4-3bfd-49f0-bb6c-801a259cfd6c]
cloudflare_zero_trust_access_application.applications["msr-2"]: Modifications complete after 0s [id=691b1dd6-ec52-4661-9cc0-fee6fb878179]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Modifying... [id=5d3c261b-d8db-4111-9eff-e9b47b5050e1]0m
cloudflare_zero_trust_access_application.applications["gate-peterovi"]: Modifying... [id=9f055b30-d866-4f4d-8193-58dbe7e3c35d]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Modifications complete after 0s [id=f1ce7728-8f01-4b03-9e07-25d4c4383d6f]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Modifications complete after 0s [id=d9f86441-7de2-443f-85e1-0790a9d59372]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Modifications complete after 0s [id=a5acb80a-2caf-43f8-8f59-4711bdfaa0ad]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Modifications complete after 0s [id=373a3587-41f2-48b1-a3b3-77642261452d]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Modifications complete after 0s [id=5d3c261b-d8db-4111-9eff-e9b47b5050e1]
cloudflare_zero_trust_access_application.applications["transmission"]: Modifications complete after 3s [id=dd230d90-8470-4e9a-ba23-ea5a569c8179]
cloudflare_zero_trust_access_application.applications["gate"]: Modifications complete after 2s [id=3136e7d6-6f45-4d3b-8b45-e9ec0fc51aa4]
cloudflare_zero_trust_access_application.applications["gate-peterovi"]: Modifications complete after 6s [id=9f055b30-d866-4f4d-8193-58dbe7e3c35d]

Apply complete! Resources: 0 added, 18 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tofu-cloudflare","PRNumber":210,"Program":"tfcmt","SHA1":"97cc944a9baa68f9dae7cd15b451d1c074ea2749","Vars":{},"WorkflowName":"tofu-cloudflare"} -->